2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_TechnischToegang/data/VerAntwVulberichtGeboorteMetErkenning-TC03-1-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5671005</ABONNEMENT>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>034401</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Volledigbericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Abo alleen identificerende groepen en bijbehorende expressies</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van doelbinding</brp:categorieDienst>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling">
    <brp:code>01002</brp:code>
    <brp:naam>Geboorte in Nederland met erkenning</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>036101</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:communicatieID="1">
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>${actieIdRegistratieGeboorte}</brp:actieInhoud>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers>
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>${actieIdRegistratieIdentificatienummers}</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>900188005</brp:burgerservicenummer>
          <brp:administratienummer>9098517169</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam>
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>${actieIdRegistratieOuder}</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
          <brp:indicatieNamenreeks>J</brp:indicatieNamenreeks>
          <brp:geslachtsnaamstam>Brest naar Kempen</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte>
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>${actieIdRegistratieGeboorte}</brp:actieInhoud>
          <brp:datum>${vandaag(0,0,-2)}</brp:datum>
          <brp:gemeenteCode>1773</brp:gemeenteCode>
          <brp:woonplaatsnaam>Blauwestad</brp:woonplaatsnaam>
          <brp:landGebiedCode>6030</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding>
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>${actieIdRegistratieGeboorte}</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
          <brp:code>V</brp:code>
        </brp:geslachtsaanduiding>
        <brp:betrokkenheden>
          <brp:kind brp:objecttype="Betrokkenheid" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:familierechtelijkeBetrekking brp:objecttype="Relatie" brp:objectSleutel="*">
              <brp:betrokkenheden>
                <brp:ouder brp:objecttype="Betrokkenheid" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:persoon brp:objecttype="Persoon">
                    <brp:identificatienummers>
                      <brp:tijdstipRegistratie>1977-12-10T01:00:00.000+01:00</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1977-12-10</brp:datumAanvangGeldigheid>
                      <brp:burgerservicenummer>900171868</brp:burgerservicenummer>
                      <brp:administratienummer>9036180623</brp:administratienummer>
                    </brp:identificatienummers>
                    <brp:samengesteldeNaam>
                      <brp:tijdstipRegistratie>1977-12-10T01:00:00.000+01:00</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1977-12-10</brp:datumAanvangGeldigheid>
                      <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                      <brp:voornamen>Bas</brp:voornamen>
                      <brp:geslachtsnaamstam>Cuykelaer</brp:geslachtsnaamstam>
                    </brp:samengesteldeNaam>
                    <brp:geboorte>
                      <brp:tijdstipRegistratie>1977-12-10T01:00:00.000+01:00</brp:tijdstipRegistratie>
                      <brp:datum>1977-12-10</brp:datum>
                      <brp:gemeenteCode>0394</brp:gemeenteCode>
                      <brp:woonplaatsnaam>Reijmerstok</brp:woonplaatsnaam>
                      <brp:landGebiedCode>6030</brp:landGebiedCode>
                    </brp:geboorte>
                    <brp:geslachtsaanduiding>
                      <brp:tijdstipRegistratie>1977-12-10T01:00:00.000+01:00</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1977-12-10</brp:datumAanvangGeldigheid>
                      <brp:code>M</brp:code>
                    </brp:geslachtsaanduiding>
                  </brp:persoon>
                </brp:ouder>
                <brp:ouder brp:objecttype="Betrokkenheid" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:persoon brp:objecttype="Persoon">
                    <brp:identificatienummers>
                      <brp:tijdstipRegistratie>1988-04-25T02:00:00.000+02:00</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1988-04-25</brp:datumAanvangGeldigheid>
                      <brp:burgerservicenummer>900100540</brp:burgerservicenummer>
                      <brp:administratienummer>9068198053</brp:administratienummer>
                    </brp:identificatienummers>
                    <brp:samengesteldeNaam>
                      <brp:tijdstipRegistratie>1988-04-25T02:00:00.000+02:00</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1988-04-25</brp:datumAanvangGeldigheid>
                      <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                      <brp:voornamen>Petronella</brp:voornamen>
                      <brp:geslachtsnaamstam>Brest naar Kempen</brp:geslachtsnaamstam>
                    </brp:samengesteldeNaam>
                    <brp:geboorte>
                      <brp:tijdstipRegistratie>1988-04-25T02:00:00.000+02:00</brp:tijdstipRegistratie>
                      <brp:datum>1988-04-25</brp:datum>
                      <brp:buitenlandsePlaats>BLTestplaats3</brp:buitenlandsePlaats>
                      <brp:landGebiedCode>5010</brp:landGebiedCode>
                    </brp:geboorte>
                    <brp:geslachtsaanduiding>
                      <brp:tijdstipRegistratie>1988-04-25T02:00:00.000+02:00</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1988-04-25</brp:datumAanvangGeldigheid>
                      <brp:code>V</brp:code>
                    </brp:geslachtsaanduiding>
                  </brp:persoon>
                </brp:ouder>
              </brp:betrokkenheden>
            </brp:familierechtelijkeBetrekking>
          </brp:kind>
        </brp:betrokkenheden>
        <brp:administratieveHandelingen>
          <brp:administratieveHandeling brp:objecttype="AdministratieveHandeling" brp:objectSleutel="*">
            <brp:code>01002</brp:code>
            <brp:naam>Geboorte in Nederland met erkenning</brp:naam>
            <brp:categorie>Actualisering</brp:categorie>
            <brp:partijCode>036101</brp:partijCode>
            <brp:bronnen>
              <brp:bron brp:objecttype="AdministratieveHandelingBron" brp:communicatieID="*">
                <brp:document brp:objecttype="Document" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:soortNaam>Geboorteakte</brp:soortNaam>
                  <brp:identificatie>GA0530-1C0001</brp:identificatie>
                  <brp:aktenummer>1CA0001</brp:aktenummer>
                  <brp:partijCode>036101</brp:partijCode>
                </brp:document>
              </brp:bron>
            </brp:bronnen>
            <brp:bijgehoudenActies>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie${actieIdRegistratieGeboorte}">
                <brp:soortNaam>Registratie geboorte</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie${actieIdRegistratieIdentificatienummers}">
                <brp:soortNaam>Registratie identificatienummers</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie${actieIdRegistratieOuder}">
                <brp:soortNaam>Registratie ouder</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
            </brp:bijgehoudenActies>
          </brp:administratieveHandeling>
        </brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
            <NAAM>Abo alleen identificerende groepen en bijbehorende expressies</NAAM>
        </Row>
    </ResultSet>
</Results>